#include <stdio.h>

int main() {
    int A, B, C, D, E, F, G;

    A = -2 + 5 * 2;       // 5x2 = 10 ไป -2 + 10 = 8#
    printf("A = %d\n", A);

    B = 10 / 2 * 3;       // 10 หาร 2 = 5 ไป 5x3 = 15#
    printf("B = %d\n", B);

    C = 6 / 2 + 3 * (4 % 2); // 6 หาร 2 = 3 ไป 4%2 = 0 ไป 3x0 = 0 ไป 3+0 = 3#
    printf("C = %d\n", C);

    D = (5 + 2) * 15 % 4; // 5+2 = 7 ไป 7x15 = 105 ไป 105%4 = 1#
    printf("D = %d\n", D);

    E = 6 + 2 * 2 - 6 / 2; // 2x2 = 4 ไป 6 หาร 2 = 3 ไป 6+4-3 = 7#
    printf("E = %d\n", E);

    F = 5 + 3 * 2 - 8 / 4 + (6 % 5); // 3x2 = 6 ไป 8 หาร 4 = 2 ไป 6%5 = 1 ไป 5+6-2+1 = 10#
    printf("F = %d\n", F);

    G = (4 + 3) * 2 - 10 / (2 + 3); // 4+3 = 7 ไป 7x2 = 14 ไป 2+3 = 5 ไป 10 หาร 5 = 2 ไป 14 - 2 = 12#
    printf("G = %d\n", G);

    return 0;
}
